Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd
data = [4,8,15,16,23,42]
pseries = pd.Series(data)

In [2]:
print(pseries)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

Ans-

In [3]:
my_list = [26,24,4,6,8,3,5,33,77,66]

ayush_series = pd.Series(my_list)

In [4]:
print(ayush_series)

0    26
1    24
2     4
3     6
4     8
5     3
6     5
7    33
8    77
9    66
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
Then, print the DataFrame.

Ans

In [5]:
data = {
    "Name" :["Alice","Bob","Clair"],
    "Age" :[25,30,27],
    "Gender" :["Female","Male","Female"]
}
    
df = pd.DataFrame(data)

In [6]:
df

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Clair   27  Female

In [7]:
type(df)

pandas.core.frame.DataFrame

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans- 

Dataframe - dataFrame is a two dimensional ,tabular data structure that consists of rows and columns it is smilar to a spreadsheet or sql table 

Pandas.Series - Pandas Series is one dimensional array and a specified name 
Series is useful when dealing with a singal variable or feature

In [8]:
#DATAFRAME EXAMPLE
d_example = {
    'name' : ['ayush','simran','sweta','rajesh'],
    'age' : [20,16,18,45],
}
df1 = pd.DataFrame(d_example)

#series_example

s_example = pd.Series([3,3,23,32,332,3,2,232,])

In [9]:
df1

     name  age
0   ayush   20
1  simran   16
2   sweta   18
3  rajesh   45

In [10]:
print(s_example)

0      3
1      3
2     23
3     32
4    332
5      3
6      2
7    232
dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Ans -

.head(n) - return the first n rows of a dataframe
max- 5 rows

.tail(n) - return the last  n rows of a data frame
max- 5 columns

.describe() - it is used summary statistic for each column

shape() - shape returns a tuple representing the dimensions (rows, columns) of the DataFrame.

all example

In [14]:
data1 = {
    'Name': ['ayush', 'sweta', 'simran', 'rajesh','alok' , 'sumit' ],
    'Age': [20, 18, 17, 45, 20, 21],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago' , 'dubai' , 'london' ]
}

df2 = pd.DataFrame(data1)

In [16]:
df2.head(4)

     Name  Age           City
0   ayush   20       New York
1   sweta   18  San Francisco
2  simran   17    Los Angeles
3  rajesh   45        Chicago

In [17]:
df2.tail()

     Name  Age           City
1   sweta   18  San Francisco
2  simran   17    Los Angeles
3  rajesh   45        Chicago
4    alok   20          dubai
5   sumit   21         london

In [18]:
df2.describe()

             Age
count   6.000000
mean   23.500000
std    10.634848
min    17.000000
25%    18.500000
50%    20.000000
75%    20.750000
max    45.000000

In [20]:
df2.shape

(6, 3)

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans- 
Both Pandas Series and DataFrames are mutable, allowing for changes to their values after creation. However, Panels are deprecated, and it's recommended to use other data structures for three-dimensional data.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [24]:
NAMES = pd.Series(["ROHIT SHARMA", "VIRAT KHOLI", "MS DHONI", "SACHIN TENDULKAR", "VIRENDER SEHWAG"])

AGE =  pd.Series([36, 34, 42, 49, 44])

TOTAL_RUNS = pd.Series([16458, 21901, 10773, 34357, 17253])

HALF_CENTURIES = pd.Series([73, 105, 73, 164, 721])

CENTURIES = pd.Series([29, 76, 10, 100, 38])

data6 = {
    "NAMES": NAMES,
    "AGE" : AGE,
    "TOTAL RUNS": TOTAL_RUNS, 
    "HALF CENTURIES" : HALF_CENTURIES, 
    "CENTURIES" : CENTURIES
}

CRICKET_DETAILS = pd.DataFrame(data6)

In [25]:
CRICKET_DETAILS

              NAMES  AGE  TOTAL RUNS  HALF CENTURIES  CENTURIES
0      ROHIT SHARMA   36       16458              73         29
1       VIRAT KHOLI   34       21901             105         76
2          MS DHONI   42       10773              73         10
3  SACHIN TENDULKAR   49       34357             164        100
4   VIRENDER SEHWAG   44       17253             721         38